In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv('tips.csv')

In [5]:
df.head(5)

   total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0       16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1       10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2       21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3       23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4       24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251

[5 rows x 11 columns]

# Conditional Filtering

In [22]:
bill_bool = df['total_bill'] > 40
sex_bool = df['sex'] == 'Male'

#AND & -- for both conditions to be true
#OR  | -- for one condition to be true

#df[(df['total_bill'] > 40) & (df['sex'] == 'Male')]

In [23]:
print(len(bill_bool))
print(len(sex_bool))

244
244

In [24]:
bool_final = (bill_bool & sex_bool)

In [25]:
df[bool_final]

     total_bill    tip   sex  ...       Payer Name         CC Number Payment ID
59        48.27   6.73  Male  ...      Brian Ortiz  6596453823950595    Sat8139
95        40.17   4.73  Male  ...    Aaron Bentley   180026611638690    Fri9628
142       41.19   5.00  Male  ...     Eric Andrews  4356531761046453   Thur3621
156       48.17   5.00  Male  ...    Ryan Gonzales  3523151482063321    Sun7518
170       50.81  10.00  Male  ...    Gregory Clark  5473850968388236    Sat1954
182       45.35   3.50  Male  ...     Jose Parsons  4112207559459910    Sun2337
184       40.55   3.00  Male  ...      Stephen Cox  3547798222044029    Sun5140
212       48.33   9.00  Male  ...  Alex Williamson      676218815212    Sat4590

[8 rows x 11 columns]

In [27]:
options = ['Sat', 'Sun']
df[df['day'].isin(options)]

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1         10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2         21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3         23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4         24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251
..          ...   ...     ...  ...                 ...               ...        ...
238       35.83  4.67  Female  ...      Kimberly Crane      676184013727    Sat9777
239       29.03  5.92    Male  ...       Michael Avila  5296068606052842    Sat2657
240       27.18  2.00  Female  ...      Monica Sanders  3506806155565404    Sat1766
241       22.67  2.00    Male  ...          Keith Wong  6011891618747196    Sat3880
242       17.82  1.75    Male  ...        Dennis Dixon     4375220550950      Sat17

[163 rows x 11 columns]

# Apply Methods
.apply() method

In [30]:
def last_four(n):
    return str(n)[-4:]

In [32]:
df['last_four'] = df['CC Number'].apply(last_four)
df.head(5)

   total_bill   tip     sex  ...         CC Number Payment ID last_four
0       16.99  1.01  Female  ...  3560325168603410    Sun2959      3410
1       10.34  1.66    Male  ...  4478071379779230    Sun4608      9230
2       21.01  3.50    Male  ...  6011812112971322    Sun4458      1322
3       23.68  3.31    Male  ...  4676137647685994    Sun5260      5994
4       24.59  3.61  Female  ...  4832732618637221    Sun2251      7221

[5 rows x 12 columns]

In [33]:
def yelp(bill):
    if bill <= 10: 
        return '$'
    elif bill > 10 and bill < 30: 
        return '$$'
    else:
        return '$$$'

In [34]:
df['yelp'] = df['total_bill'].apply(yelp)

In [37]:
df.head(5)

   total_bill   tip     sex smoker  ...         CC Number Payment ID  last_four  yelp
0       16.99  1.01  Female     No  ...  3560325168603410    Sun2959       3410    $$
1       10.34  1.66    Male     No  ...  4478071379779230    Sun4608       9230    $$
2       21.01  3.50    Male     No  ...  6011812112971322    Sun4458       1322    $$
3       23.68  3.31    Male     No  ...  4676137647685994    Sun5260       5994    $$
4       24.59  3.61  Female     No  ...  4832732618637221    Sun2251       7221    $$

[5 rows x 13 columns]

In [38]:
df['total_bill'].apply(lambda x : x * 2)

0      33.98
1      20.68
2      42.02
3      47.36
4      49.18
       ...
239    58.06
240    54.36
241    45.34
242    35.64
243    37.56
Name: total_bill, Length: 244, dtype: float64

In [39]:
def quality(total_bill, tip):
    if tip/total_bill > 0.25:
        return 'Generous'
    else:
        return 'Other'

In [45]:
%%time
df['Tip Quality'] = df[['total_bill', 'tip']].apply(lambda d : quality(d['total_bill'], d['tip']), axis = 1)

CPU times: user 7.55 ms, sys: 1.99 ms, total: 9.54 ms
Wall time: 20.1 ms

In [46]:
%%time
df['Tip Quality'] = np.vectorize(quality)(df['total_bill'], df['tip'])

CPU times: user 1.3 ms, sys: 0 ns, total: 1.3 ms
Wall time: 1.31 ms

In [47]:
df.head(5)

   total_bill   tip     sex smoker  ... Payment ID last_four  yelp  Tip Quality
0       16.99  1.01  Female     No  ...    Sun2959      3410    $$        Other
1       10.34  1.66    Male     No  ...    Sun4608      9230    $$        Other
2       21.01  3.50    Male     No  ...    Sun4458      1322    $$        Other
3       23.68  3.31    Male     No  ...    Sun5260      5994    $$        Other
4       24.59  3.61  Female     No  ...    Sun2251      7221    $$        Other

[5 rows x 14 columns]

# Other Methods

In [48]:
df = pd.read_csv('tips.csv')

In [49]:
df.describe().transpose()

                  count          mean  ...           75%           max
total_bill        244.0  1.978594e+01  ...  2.412750e+01  5.081000e+01
tip               244.0  2.998279e+00  ...  3.562500e+00  1.000000e+01
size              244.0  2.569672e+00  ...  3.000000e+00  6.000000e+00
price_per_person  244.0  7.888197e+00  ...  9.390000e+00  2.027000e+01
CC Number         244.0  2.563496e+15  ...  4.553675e+15  6.596454e+15

[5 rows x 8 columns]

In [54]:
df.sort_values(['tip', 'size'], axis = 0, ascending = True)

     total_bill    tip     sex  ...          Payer Name         CC Number Payment ID
67         3.07   1.00  Female  ...       Tiffany Brock  4359488526995267    Sat3455
111        7.25   1.00  Female  ...         Terri Jones  3559221007826887    Sat4801
92         5.75   1.00  Female  ...        Leah Ramirez  3508911676966392    Fri3780
236       12.60   1.00    Male  ...       Matthew Myers  3543676378973965    Sat5032
0         16.99   1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
..          ...    ...     ...  ...                 ...               ...        ...
141       34.30   6.70    Male  ...      Steven Carlson  3526515703718508   Thur1025
59        48.27   6.73    Male  ...         Brian Ortiz  6596453823950595    Sat8139
23        39.42   7.58    Male  ...      Lance Peterson  3542584061609808     Sat239
212       48.33   9.00    Male  ...     Alex Williamson      676218815212    Sat4590
170       50.81  10.00    Male  ...       Gregory Clark  5473850968388236    Sat1954

[244 rows x 11 columns]

In [57]:
print(df['total_bill'].max())
print(df['total_bill'].argmax())

50.81
170

In [59]:
df.iloc[df['total_bill'].argmax()]

total_bill                     50.81
tip                               10
sex                             Male
smoker                           Yes
day                              Sat
time                          Dinner
size                               3
price_per_person               16.94
Payer Name             Gregory Clark
CC Number           5473850968388236
Payment ID                   Sat1954
Name: 170, dtype: object

In [60]:
df.corr()

                  total_bill       tip      size  price_per_person  CC Number
total_bill          1.000000  0.675734  0.598315          0.647554   0.104576
tip                 0.675734  1.000000  0.489299          0.347405   0.110857
size                0.598315  0.489299  1.000000         -0.175359  -0.030239
price_per_person    0.647554  0.347405 -0.175359          1.000000   0.135240
CC Number           0.104576  0.110857 -0.030239          0.135240   1.000000

In [64]:
df['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [65]:
df['day'].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [66]:
df['sex'].replace('Female', 'F')

0         F
1      Male
2      Male
3      Male
4         F
       ...
239    Male
240       F
241    Male
242    Male
243       F
Name: sex, Length: 244, dtype: object

In [67]:
df['sex'].replace(['Female', 'Male'], ['F', 'M'])

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [68]:
mapping_sex = {
    'Female' : 'F',
    'Male' : 'M'
}

In [69]:
df['sex'].map(mapping_sex)

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [70]:
df.duplicated()       #Returns the first instance of any duplicate rows

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Length: 244, dtype: bool

In [72]:
simple_df = pd.DataFrame(data = [[1, 2, 3, 4], [5, 6, 7, 8], [1, 2, 3, 4]], index = ['A', 'B', 'C'], columns = [10, 11, 12, 13])

In [73]:
simple_df

   10  11  12  13
A   1   2   3   4
B   5   6   7   8
C   1   2   3   4

In [74]:
simple_df.duplicated()

A    False
B    False
C     True
dtype: bool

In [77]:
simple_df.drop_duplicates(inplace = True)

In [78]:
simple_df

   10  11  12  13
A   1   2   3   4
B   5   6   7   8

In [82]:
df[(df['total_bill'] >= 10) & (df['total_bill'] <= 20)]

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1         10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
8         15.04  1.96    Male  ...     Joseph Mcdonald  3522866365840377    Sun6820
9         14.78  3.23    Male  ...       Jerome Abbott  3532124519049786    Sun3775
10        10.27  1.71    Male  ...       William Riley      566287581219    Sun2546
..          ...   ...     ...  ...                 ...               ...        ...
234       15.53  3.00    Male  ...       Tracy Douglas  4097938155941930    Sat7220
235       10.07  1.25    Male  ...       Sean Gonzalez  3534021246117605    Sat4615
236       12.60  1.00    Male  ...       Matthew Myers  3543676378973965    Sat5032
242       17.82  1.75    Male  ...        Dennis Dixon     4375220550950      Sat17
243       18.78  3.00  Female  ...     Michelle Hardin  3511451626698139    Thur672

[130 rows x 11 columns]

In [85]:
df[df['total_bill'].between(10, 20, inclusive = True)]

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1         10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
8         15.04  1.96    Male  ...     Joseph Mcdonald  3522866365840377    Sun6820
9         14.78  3.23    Male  ...       Jerome Abbott  3532124519049786    Sun3775
10        10.27  1.71    Male  ...       William Riley      566287581219    Sun2546
..          ...   ...     ...  ...                 ...               ...        ...
234       15.53  3.00    Male  ...       Tracy Douglas  4097938155941930    Sat7220
235       10.07  1.25    Male  ...       Sean Gonzalez  3534021246117605    Sat4615
236       12.60  1.00    Male  ...       Matthew Myers  3543676378973965    Sat5032
242       17.82  1.75    Male  ...        Dennis Dixon     4375220550950      Sat17
243       18.78  3.00  Female  ...     Michelle Hardin  3511451626698139    Thur672

[130 rows x 11 columns]

In [88]:
df.nlargest(10, columns = ['tip', 'total_bill'])

     total_bill    tip     sex  ...         Payer Name         CC Number Payment ID
170       50.81  10.00    Male  ...      Gregory Clark  5473850968388236    Sat1954
212       48.33   9.00    Male  ...    Alex Williamson      676218815212    Sat4590
23        39.42   7.58    Male  ...     Lance Peterson  3542584061609808     Sat239
59        48.27   6.73    Male  ...        Brian Ortiz  6596453823950595    Sat8139
141       34.30   6.70    Male  ...     Steven Carlson  3526515703718508   Thur1025
214       28.17   6.50  Female  ...    Marissa Jackson  4922302538691962    Sat3374
183       23.17   6.50    Male  ...  Dr. Michael James     4718501859162    Sun6059
47        32.40   6.00    Male  ...       James Barnes  3552002592874186    Sun9677
239       29.03   5.92    Male  ...      Michael Avila  5296068606052842    Sat2657
88        24.71   5.85    Male  ...       Roger Taylor     4410248629955   Thur9003

[10 rows x 11 columns]

In [90]:
df.sample(frac = 0.1, random_state = 5)

     total_bill   tip  ...         CC Number Payment ID
55        19.49  3.51  ...  6502227786581768    Sun1118
191       19.81  4.19  ...  4317015327600068    Thur967
210       30.06  2.00  ...    30184049218122    Sat8361
96        27.28  4.00  ...  4563054452787961    Fri3159
163       13.81  2.00  ...  5552793481414044    Sun8594
150       14.07  2.50  ...  4813617017359506    Sun8863
240       27.18  2.00  ...  3506806155565404    Sat1766
51        10.29  2.60  ...     4999759463713    Sun4474
140       17.47  3.50  ...  5233918213804470   Thur3906
89        21.16  3.00  ...  4356005144080422   Thur6273
104       20.92  4.08  ...  4013010878990106    Sat3194
197       43.11  5.00  ...  5544902205760175   Thur9313
75        10.51  1.25  ...   213142079731108    Sat5056
98        21.01  3.00  ...  4831801127457917     Fri144
42        13.94  3.06  ...    36231182760859    Sun1699
61        13.81  2.00  ...     4766834726806    Sat3030
227       20.45  3.00  ...   213141668145910    Sat4319
130       19.08  1.50  ...   213113680829581   Thur1446
56        38.01  3.00  ...   349793629453226    Sat8903
6          8.77  2.00  ...  2223727524230344    Sun5985
123       15.95  2.00  ...  4820629318698319   Thur1992
149        7.51  2.00  ...  4823139288341889   Thur6321
174       16.82  4.00  ...  3586342145399277    Sun7621
194       16.58  4.00  ...      676210011505   Thur9318

[24 rows x 11 columns]

# Missing Data

In [126]:
df = pd.read_csv('movie_scores.csv')

In [127]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [128]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [129]:
df[df['pre_movie_score'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [130]:
df.dropna?

In [131]:
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [132]:
df.dropna(thresh = 3)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [133]:
df.dropna(axis = 1, thresh = 1)

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [134]:
df.dropna(subset = ['first_name', 'last_name'])

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [136]:
df.fillna('NEW VALUE!')

   first_name   last_name  ... pre_movie_score post_movie_score
0         Tom       Hanks  ...               8               10
1  NEW VALUE!  NEW VALUE!  ...      NEW VALUE!       NEW VALUE!
2        Hugh     Jackman  ...      NEW VALUE!       NEW VALUE!
3       Oprah     Winfrey  ...               6                8
4        Emma       Stone  ...               7                9

[5 rows x 6 columns]

In [115]:
#df['pre_movie_score'].fillna(0, inplace = True)

In [138]:
df['pre_movie_score'].mean()

7.0

In [140]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean(), inplace = True)

In [141]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              7.0               NaN
2       Hugh   Jackman  51.0    m              7.0               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [142]:
airline_tix = {'first': 100, 'business': np.nan, 'economy-plus': 50, 'economy': 30}

In [147]:
ser = pd.Series(airline_tix)

In [148]:
ser

first           100.0
business          NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [149]:
ser.interpolate()

first           100.0
business         75.0
economy-plus     50.0
economy          30.0
dtype: float64